/**
  ******************************************************************************
  * @文件         uart1.h
  * @作者         LGG
  * @版本         V1.0.0
  * @日期         2017-11-18
  * @摘要         uart1头文件
  ******************************************************************************
*/ 

/* 定义防止递归包含 ----------------------------------------------------------*/
#ifndef __UART1__H
#define __UART1__H

/* 包含头文件 ----------------------------------------------------------------*/
#include "stm8s.h"

#define UART1_SEND_DELAY_COUNT    (500)

/* 函数声明-------------------------------------------------------------------*/
void UART1_Config(void);
void UART1_SendByte(uint8_t byte);
void UART1_Send_IntToStr(uint16_t num);
void UART1_printf(char* str);
#endif

/************************ Copyright (C)2017 LGG. All Rights Reserved *****END OF FILE****/

